MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV256GM102/mcu.h
#define _C1RXF15EID_EID12_POSITION               0x0000000C
#define _C1RXF15EID_EID12_MASK                   0x00001000
#define _C1RXF15EID_EID12_LENGTH                 0x00000001

#define _C1RXF15EID_EID13_POSITION               0x0000000D
#define _C1RXF15EID_EID13_MASK                   0x00002000
#define _C1RXF15EID_EID13_LENGTH                 0x00000001

#define _C1RXF15EID_EID14_POSITION               0x0000000E
#define _C1RXF15EID_EID14_MASK                   0x00004000
#define _C1RXF15EID_EID14_LENGTH                 0x00000001

#define _C1RXF15EID_EID15_POSITION               0x0000000F
#define _C1RXF15EID_EID15_MASK                   0x00008000
#define _C1RXF15EID_EID15_LENGTH                 0x00000001

#define _C1RXF15EID_EID_POSITION                 0x00000000
#define _C1RXF15EID_EID_MASK                     0x0000FFFF
#define _C1RXF15EID_EID_LENGTH                   0x00000010

#define _SENT1CON1_NIBCNT_POSITION               0x00000000
#define _SENT1CON1_NIBCNT_MASK                   0x00000007
#define _SENT1CON1_NIBCNT_LENGTH                 0x00000003

#define _SENT1CON1_PS_POSITION                   0x00000004
#define _SENT1CON1_PS_MASK                       0x00000010
#define _SENT1CON1_PS_LENGTH                     0x00000001

#define _SENT1CON1_SPCEN_POSITION                0x00000006
#define _SENT1CON1_SPCEN_MASK                    0x00000040
#define _SENT1CON1_SPCEN_LENGTH                  0x00000001

#define _SENT1CON1_PPP_POSITION                  0x00000007
#define _SENT1CON1_PPP_MASK                      0x00000080
#define _SENT1CON1_PPP_LENGTH                    0x00000001

#define _SENT1CON1_CRCEN_POSITION                0x00000008
#define _SENT1CON1_CRCEN_MASK                    0x00000100
#define _SENT1CON1_CRCEN_LENGTH                  0x00000001

#define _SENT1CON1_TXPOL_POSITION                0x00000009
#define _SENT1CON1_TXPOL_MASK                    0x00000200
#define _SENT1CON1_TXPOL_LENGTH                  0x00000001

#define _SENT1CON1_TXM_POSITION                  0x0000000A
#define _SENT1CON1_TXM_MASK                      0x00000400
#define _SENT1CON1_TXM_LENGTH                    0x00000001

#define _SENT1CON1_RCVEN_POSITION                0x0000000B
#define _SENT1CON1_RCVEN_MASK                    0x00000800
#define _SENT1CON1_RCVEN_LENGTH                  0x00000001

#define _SENT1CON1_SNTSIDL_POSITION              0x0000000D
#define _SENT1CON1_SNTSIDL_MASK                  0x00002000
#define _SENT1CON1_SNTSIDL_LENGTH                0x00000001

#define _SENT1CON1_SNTEN_POSITION                0x0000000F
#define _SENT1CON1_SNTEN_MASK                    0x00008000
#define _SENT1CON1_SNTEN_LENGTH                  0x00000001

#define _SENT1STAT_SYNCTXEN_POSITION             0x00000000
#define _SENT1STAT_SYNCTXEN_MASK                 0x00000001
#define _SENT1STAT_SYNCTXEN_LENGTH               0x00000001

#define _SENT1STAT_RXIDLE_POSITION               0x00000001
#define _SENT1STAT_RXIDLE_MASK                   0x00000002
#define _SENT1STAT_RXIDLE_LENGTH                 0x00000001

#define _SENT1STAT_FRMERR_POSITION               0x00000002
#define _SENT1STAT_FRMERR_MASK                   0x00000004
#define _SENT1STAT_FRMERR_LENGTH                 0x00000001

#define _SENT1STAT_CRCERR_POSITION               0x00000003
#define _SENT1STAT_CRCERR_MASK                   0x00000008
#define _SENT1STAT_CRCERR_LENGTH                 0x00000001

#define _SENT1STAT_NIB_POSITION                  0x00000004
#define _SENT1STAT_NIB_MASK                      0x00000070
#define _SENT1STAT_NIB_LENGTH                    0x00000003

#define _SENT1STAT_PAUSE_POSITION                0x00000007
#define _SENT1STAT_PAUSE_MASK                    0x00000080
#define _SENT1STAT_PAUSE_LENGTH                  0x00000001

#define _SENT1STAT_SYNC_POSITION                 0x00000000
#define _SENT1STAT_SYNC_MASK                     0x00000001
#define _SENT1STAT_SYNC_LENGTH                   0x00000001

#define _SENT1STAT_NIB0_POSITION                 0x00000004
#define _SENT1STAT_NIB0_MASK                     0x00000010
#define _SENT1STAT_NIB0_LENGTH                   0x00000001

#define _SENT1STAT_NIB1_POSITION                 0x00000005
#define _SENT1STAT_NIB1_MASK                     0x00000020
#define _SENT1STAT_NIB1_LENGTH                   0x00000001

#define _SENT1STAT_NIB2_POSITION                 0x00000006
#define _SENT1STAT_NIB2_MASK                     0x00000040
#define _SENT1STAT_NIB2_LENGTH                   0x00000001

#define _SENT1STAT_TXEN_POSITION                 0x00000000
#define _SENT1STAT_TXEN_MASK                     0x00000001
#define _SENT1STAT_TXEN_LENGTH                   0x00000001

#define _SENT1DATL_CRC_POSITION                  0x00000000
#define _SENT1DATL_CRC_MASK                      0x0000000F
#define _SENT1DATL_CRC_LENGTH                    0x00000004

#define _SENT1DATL_DATA6_POSITION                0x00000004
#define _SENT1DATL_DATA6_MASK                    0x000000F0
#define _SENT1DATL_DATA6_LENGTH                  0x00000004

#define _SENT1DATL_DATA5_POSITION                0x00000008
#define _SENT1DATL_DATA5_MASK                    0x00000F00
#define _SENT1DATL_DATA5_LENGTH                  0x00000004

#define _SENT1DATL_DATA4_POSITION                0x0000000C
#define _SENT1DATL_DATA4_MASK                    0x0000F000
#define _SENT1DATL_DATA4_LENGTH                  0x00000004

#define _SENT1DATL_CRC0_POSITION                 0x00000000
#define _SENT1DATL_CRC0_MASK                     0x00000001
#define _SENT1DATL_CRC0_LENGTH                   0x00000001

#define _SENT1DATL_CRC1_POSITION                 0x00000001
#define _SENT1DATL_CRC1_MASK                     0x00000002
#define _SENT1DATL_CRC1_LENGTH                   0x00000001

#define _SENT1DATL_CRC2_POSITION                 0x00000002
#define _SENT1DATL_CRC2_MASK                     0x00000004
#define _SENT1DATL_CRC2_LENGTH                   0x00000001

#define _SENT1DATL_CRC3_POSITION                 0x00000003
#define _SENT1DATL_CRC3_MASK                     0x00000008
#define _SENT1DATL_CRC3_LENGTH                   0x00000001

#define _SENT1DATL_DATA60_POSITION               0x00000004
#define _SENT1DATL_DATA60_MASK                   0x00000010
#define _SENT1DATL_DATA60_LENGTH                 0x00000001

#define _SENT1DATL_DATA61_POSITION               0x00000005
#define _SENT1DATL_DATA61_MASK                   0x00000020
#define _SENT1DATL_DATA61_LENGTH                 0x00000001

